---
type: StructuralSectionRectangular
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 5
tags: [revit-api, class]
---

# StructuralSectionRectangular

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CentroidHorizontal | 2015 | `public double CentroidHorizontal { get ; set ; }` |
| Property | CentroidVertical | 2015 | `public double CentroidVertical { get ; set ; }` |
| Property | Height | 2015 | `public double Height { get ; set ; }` |
| Property | NameKey | 2015 | `public string NameKey { get ; set ; }` |
| Property | Width | 2015 | `public double Width { get ; set ; }` |